{"data":{"site":{"siteMetadata":{"title":"Random Stuff About Stuff","author":"David Kerwick"}},"markdownRemark":{"id":"771e6f42-c419-5d10-bf1b-2cccd04028e0","excerpt":"So while editing markdown is pretty easy I do of course want it to be easier ;)\nSo there’s a not so little world of markdown editors out there all of which…","html":"<p>So while editing markdown is pretty easy I do of course want it to be easier ;)\nSo there’s a not so little world of markdown editors out there all of which promise blissful blogging, with helpful auto complete and an auto updated preview.</p>\n<p>I downloaded a few trails and for my needs they didn’t hit the mark.\nBear in mind I’m an occasional blogger and mainly I’m pasting in code.</p>\n<p>Now Wordsworth I ain’t so worlds shortest and least detailed reviews.</p>\n<p><a href=\"http://realmacsoftware.com/typed/\">Typed</a>\nLooks nice, jekyll front matter bit of an issue and jekyll hightlight the same, also costs money</p>\n<p><a href=\"http://www.ulyssesapp.com/\">Ulyssesapp</a>\nErr sledge hammer to crack a walnut, same problems as above and in order to support iPad file treatment is wierd, cost a good bit of money</p>\n<p><a href=\"http://www.ashokgelal.com/lightpaper-for-mac/\">Light Paper</a>\nLiked it, simple you can disable displaying of the jekyll front matter, it’s free.\nUsed it for a few posts, with the amount of code blocks I seem to add the preview was proving pointless, if you use normal markdown code you’ll be fine there was also no way of speeding up the adding the highlight code blocks.</p>\n<p><a href=\"http://www.sublimetext.com/\">Sublime Text</a>\nOk Ok what’s bigger then a sledge hammer for this walnut of mine…\nSo trailing it now, the main benfit it the plugins (for me) in particular the package <a href=\"https://packagecontrol.io/packages/Jekyll\">Jekyll</a> package name says it all really.  It seems to be awesome! For my needs anyway hit highlight[tab] you get your code block that’s great, it highlight’s stuff in between those types of Jekyll tags and has handy commands for new draft, post and prompt draft.\nWorth the price, for my blogging probably not, I’ll trail it for a few posts and see, Sublime has alot of other stuff going for it so we will see</p>","frontmatter":{"title":"Markdown Editors","date":"July 24, 2015"}}},"pageContext":{"slug":"/2015-07-24-markdown-editors/","previous":{"fields":{"slug":"/2015-06-24-importing-blogger/"},"frontmatter":{"title":"Importing Blogger into Jekyll"}},"next":{"fields":{"slug":"/2015-07-24-tidying-up-blogger-import/"},"frontmatter":{"title":"Tidying up Blogger Import"}}}}