{"data":{"site":{"siteMetadata":{"title":"Random Stuff About Stuff","author":"David Kerwick"}},"markdownRemark":{"id":"62ebbe33-34ab-5845-9c10-f38a4a386af3","excerpt":"So having installed zsh and done some basic config it’s time to really pimp it out and from what I can see that means installing  oh-my-zsh  that install is…","html":"<p>So having installed zsh and done some basic config it’s time to really pimp it out and from what I can see that means installing <a href=\"http://ohmyz.sh/\">oh-my-zsh</a> that install is quick and painless, it does of course replace your .zshrc file so you will have to but back in any additions you have made there.  It does back your old one up to <code class=\"language-text\">.zshrc.pre-oh-my-zsh</code> so isn’t to difficult to add stuff back in.</p>\n<p>I’m happy with the defaults for now, but there are millions of themes and plugins to choose from. I’m sure I’ll try others out over time. But coming from bash the prompt info, tab completion and history is great.</p>\n<p>Speaking of which I set the history for shells to a huge number so I can find commands I performed ages ago, but they are all in bash and I wanted them in my new shiny shell.  The format of the history files are different so a direct copy seemed a bad idea, you as always someone else has solved it so run the script <a href=\"http://goyalankit.com/blog/2014/05/24/bash-to-zsh-history/\">here</a> and you have your full bash<em>history imported into your zsh</em>history.</p>\n<p>So I can ctrl^r to search my history, also it seems I can start a command and hit up arrow and it gives me the history starting with that command (nice) I beleive there is a plugin that make this even better, one to look at.</p>\n<h1>Getting mvn working</h1>\n<p>So while oh-my-zsh comes with git my default you have to add other plugins as you want them so for now the other main program for the command line I use is mvn.\nFor starters it wouldn’t work of course because the setting from my .bashrc were missing.  So add the maven settings back in</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token function\">export</span> MAVEN_OPTS<span class=\"token operator\">=</span><span class=\"token string\">\"-Xmx512M\"</span>\n<span class=\"token function\">export</span> JAVA_HOME<span class=\"token operator\">=</span><span class=\"token variable\"><span class=\"token variable\">$(</span>/usr/libexec/java_home<span class=\"token variable\">)</span></span></code></pre></div>\n<p>Then enable the mvn plugin in oh-my-zsh, find the plugins line in <code class=\"language-text\">.zshrc</code> and add mvn something like this</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\">plugins<span class=\"token operator\">=</span><span class=\"token punctuation\">(</span>git mvn<span class=\"token punctuation\">)</span></code></pre></div>\n<p>That gives you a world of alias’s and command line competion for the mvn command.\nI like having the output of maven colourised as it makes it easy spot errors and warnings, that’s built into the plugin but not on by default to enable it add an alias to your <code class=\"language-text\">.zshrc</code> file</p>\n<div class=\"gatsby-highlight\" data-language=\"bash\"><pre class=\"language-bash\"><code class=\"language-bash\"><span class=\"token function\">alias</span> mvn<span class=\"token operator\">=</span><span class=\"token string\">\"mvn-color\"</span></code></pre></div>\n<p>That’s the basics working and so far so good, I’m sure I’ll be adding to the plugins over time and trying new themes but the difference so far it totally worth it.</p>","frontmatter":{"title":"Pimping the zsh shell","date":"September 06, 2015"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2015-09-06-pimping-the-zsh-shell/","previous":{"fields":{"slug":"/2015-09-06-trying-out-the-zsh-shell/"},"frontmatter":{"title":"Trying out the zsh shell"}},"next":{"fields":{"slug":"/2016-02-05-bash-proxy-and-https-error/"},"frontmatter":{"title":"Bash proxy and https error"}}}}