{"data":{"site":{"siteMetadata":{"title":"Random Stuff About Stuff","author":"David Kerwick"}},"markdownRemark":{"id":"25d257b6-6529-54c2-ae8a-40ea4b7c0317","excerpt":"I’ve been using Lombok for a while now and it’s great not having to bother with alot of boiler plate.\nThe ‘problem’ is that it doesn’t play nice with the other…","html":"<p>I’ve been using Lombok for a while now and it’s great not having to bother with alot of boiler plate.\nThe ‘problem’ is that it doesn’t play nice with the other kids. So trying to use say the likes of Mapstruct or any other annotation processor.</p>\n<p>This is ‘about’ to change… Keep an eye this <a href=\"https://github.com/mapstruct/mapstruct/issues/510\">mapstruct issue</a> which should be in the next <a href=\"https://github.com/mapstruct/mapstruct/releases\">release</a> as of writing the current release is 1.1.0.Final and Lombok’s <a href=\"https://github.com/rzwitserloot/lombok/releases\">release</a> as of writing the current release is v1.16.12.</p>\n<p>But no idea when both will be released so in the mean time there’s some work arounds which hopefully can be removed once they start playing nice together.</p>\n<p>This sure seems a bit hacky but seems to work so far.  In the above issue there’s a <a href=\"https://github.com/mapstruct/mapstruct/issues/510#issuecomment-214038002\">comment</a> by Alexander Schwartz which shows how to get them working together for now.  And it runs in the one project which is nice. General theory is it delomboks the files into the <code class=\"language-text\">generated-sources</code> folder and Mapstruct can then run on those and therefore see the getters and setters.  So for Maven builds everything is happy.</p>\n<p>For IntelliJ weelll it doesn’t complain but also can’t make the changes on the fly.  So deploying to a local server can be a bit hit and miss.  You can improve things somewhat by expanding the <code class=\"language-text\">Maven Projects</code> tab on the right and going to the lifecycle of your project, right click on the compile phase and tick <code class=\"language-text\">Execute After Build</code> and <code class=\"language-text\">Execute After Rebuild</code></p>\n<p>This slows the build down a bit and doesn’t create everything but should keep things ticking over until they can all work together normally…</p>","frontmatter":{"title":"Mapstruct and Lombok working together","date":"February 01, 2017"}}},"pageContext":{"slug":"/2017-02-01-mapstruct-and-lombok-working-together/","previous":{"fields":{"slug":"/2017-02-01-intellij-adding-logger-definition/"},"frontmatter":{"title":"IntelliJ - Adding logger definition"}},"next":{"fields":{"slug":"/2017-02-01-adding-color-to-maven-output/"},"frontmatter":{"title":"Adding color to Maven output"}}}}