{"data":{"site":{"siteMetadata":{"title":"Random Stuff About Stuff","author":"David Kerwick"}},"markdownRemark":{"id":"6b9c0e79-c571-5c18-8d70-a4a3493eca9a","excerpt":"The Blogger problem So while I don’t blog a lot when I do blog it tends to have code in it and Blogger is a real pain when it comes to that. Switching between…","html":"<h1>The Blogger problem</h1>\n<p>So while I don’t blog a lot when I do blog it tends to have code in it and Blogger is a real pain when it comes to that. Switching between the overview and html, pasting the code first into a converter, taking the result of that and then pasting it into the html part of blogger, I gave up on embedding the syntax highlighter’s into Blogger itself it was an arms race I was always going to lose.  So I reasoned there must be a better way.</p>\n<p>I didn’t find any magic bullets for Blogger, Wordpress had some options (while good I’m not a fan, hence why I went with Blogger), there were some startups promising to sort it for coders and then I eventually found Jekyll, yep on the bleeding edge me.</p>\n<p>It uses Markdown which solves the copy and paste coding problem for me, you can totally test out the whole thing locally which is great, seems super fast, you have lots and lots of control, you can use local editors and lots of hosting options.</p>\n<h1>The Jekyll problem</h1>\n<p>So I’m going to embark on the journey of moving my Blogger posts to Jekyll, this can I think be done easily enough but of course I want to play with the options and probably not go with the defaults.  And with great power comes great pain ;) Because Jekyll has all the options list above it generally means more points for things to go wrong or things to set up.  While the end result is a set of html pages that should run like a rocket hosted anywhere, getting to that will involve using new fangled tech the kids are using, markdown, ruby and probably other stuff.</p>\n<h1>The Journery</h1>\n<p>I will hopefully have a series of blog posts in the new system about how the conversion goes.  Already I’m wondering considering my post rate is it really worth the bother, Blogger is pretty good after all and has loads of stuff built in. It quite happily shows me my posts are hardly ever read. I’m sure all of that can be enabled on the new blog.  But sure I’ll learn something and maybe it will encourage me to write more.</p>","frontmatter":{"title":"Getting started with Jekyll","date":"June 17, 2015"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2015-06-17-getting-started-with-jekyll/","previous":{"fields":{"slug":"/2016-02-05-creating-ssh-key-and-add-it-to-server/"},"frontmatter":{"title":"Creating an SSH key and add it to a server"}},"next":{"fields":{"slug":"/2015-06-17-publishing-blog-on-github/"},"frontmatter":{"title":"Publishing site on github"}}}}