{"data":{"site":{"siteMetadata":{"title":"Random Stuff About Stuff","author":"David Kerwick"}},"markdownRemark":{"id":"289d85b3-068e-57e4-944d-9bae9cc7f491","excerpt":"With the new flurry of activity with upgrading the blog etc… it’s time to try yet another editor for the doing the blog. I know, I know, I should just pick one…","html":"<p>With the new flurry of activity with upgrading the blog etc… it’s time to try yet another editor for the doing the blog.</p>\n<p>I know, I know, I should just pick one.  But I use it so rarely I never build up any ties to them, I don’t remember the keyboard shortcuts and generally the config I have set up breaks down etc…</p>\n<p>In this case I actually have a new machine so would have to set up whichever one from scratch anyway. So next up on the list is…</p>\n<h1>Atom</h1>\n<p>Now you would imagine this should be a match up that’s born to do the job both Atom and Jekyll are written by Github, so all the support I’ve being looking for in other editors will be built in… Alias no, doesn’t seem like Github got the memo, well in fairness I’m sure they did but it’s not on the priority list I guess. The Jekyll people created <a href=\"https://github.com/jekyll/atom-jekyll/issues/1\">this</a> but it seems to have dramatically and silently died as an idea, a pity really.</p>\n<p>That’s not to say other people haven’t stepped in to provide a few options.</p>\n<h1>jekyll-atom</h1>\n<p>The most obvious and easy to find, it’s mentioned in the atom-jekyll package, confusing huh. And can be found <a href=\"https://github.com/Arcath/jekyll-atom\">here</a></p>\n<p>It can create a new post, has snippets for the general items etc… but doesn’t seem to cover the full gamut.</p>\n<h1>markdown-writer</h1>\n<p>While not in anyway Jekyll specific it does support it and has a ton of cool features, it can be found <a href=\"https://github.com/zhuochun/md-writer\">here</a> I also installed the supporting <a href=\"https://atom.io/packages/tool-bar-markdown-writer\">toolbar</a> which is really handy for an occasional user like me you has to look up how to add a link or an image every time.  Actually the image thing is really cool as it has the option of copying the files into your blog and you can rename them using the title feature.  I find that super handy for taking screenshots and adding them to the blog.</p>\n<h1>jekyll-syntax-highlighting</h1>\n<p>Adds syntax highlighting to Jekyll code blocks, it can be found <a href=\"https://github.com/gkemmey/jekyll-syntax-highlighting\">here</a> it didn’t seem to work for me, maybe because of the move to Jekyll 3? Your mileage may vary.  It’s a nice idea.</p>\n<h1>Conclusion</h1>\n<p>Seems like Markdown Writer is the only one needed for now.  Fairly low download figures for the plugins related to the Jekyll so it seems using Atom isn’t that popular for Jekyll users, the regular users have no need for the plugins or everyone is using something else.</p>","frontmatter":{"title":"Moving to the Atom editor","date":"January 09, 2017"}}},"pageContext":{"slug":"/2017-01-09-moving-to-the-atom-editor/","previous":{"fields":{"slug":"/2017-01-05-adding-some-custom-css-for-notes/"},"frontmatter":{"title":"Adding some custom css for notes"}},"next":{"fields":{"slug":"/2017-01-14-angular-cli-material-2-and-flex-layout/"},"frontmatter":{"title":"Angular CLI, Material 2 and Flex Layout"}}}}