{"data":{"site":{"siteMetadata":{"title":"Random Stuff About Stuff","author":"David Kerwick"}},"markdownRemark":{"id":"a19232c4-4f7a-5401-920d-837db437dcca","excerpt":"Having set up a new Mac I wanted to start using it as the primary machine. I’m still old school and plug my phone into the Mac for updates and backups.\nSo for…","html":"<p>Having set up a new Mac I wanted to start using it as the primary machine. I’m still old school and plug my phone into the Mac for updates and backups.\nSo for that to work I need to transfer my music (hardly ever listen to but can’t bring myself to delete) and the last backup of the phone.</p>\n<p>Before transfer it’s worth clearing down the very old backups, I’ve has the old machine for a while and it had backups from long gone phones/ipads. And these backups are fairly big.</p>\n<p>Head to iTunes preferences then the Devices tab. Here delete as many backups as you are comfortable with.</p>\n<p>Once you have both machines on the same network you should be able to go to the new machine, find the old machine in the shared section in finder and navigate to\n<code class=\"language-text\">/Users/David/Library/Application Support/</code> and copy the MobileSync folder to the same location on your new machine (provided your user is the same on both of course)</p>\n<p>That will probably take a while.</p>\n<p>For iTunes do something similar on the new machine move or delete iTunes folder in <code class=\"language-text\">/Users/David/Music/</code> somewhere else.\nGo to the same folder on the old machine through the share and copy the iTunes folder over to <code class=\"language-text\">/Users/David/Music/</code></p>\n<p>If like me you have built up a ton of music since the first iPod days this will take a really long time.</p>\n<p>Once all done you should be able to open iTunes which will check itself, plug in your iPhone and thrust the computer and do another backup.</p>","frontmatter":{"title":"Transfer iTunes and iPhone backups to new Mac","date":"March 13, 2018"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2018-03-13-transfer-itunes-and-iphone-backups-to-new-mac/","previous":{"fields":{"slug":"/2018-02-27-jekyll-in-the-atom-editor-easier-own-post-linking/"},"frontmatter":{"title":"Jekyll in the Atom Editor easier own post linking"}},"next":{"fields":{"slug":"/moving-to-gatsby/"},"frontmatter":{"title":"Moving Blog to Gatsby"}}}}