{"data":{"site":{"siteMetadata":{"title":"Random Stuff About Stuff","author":"David Kerwick"}},"markdownRemark":{"id":"d2de6f0f-0772-5e77-9a45-255e208a3aa2","excerpt":"It’s that time again, where I look at blogging something and decide I may as well change the system I’m using first.\nA developer affliction I’m sure. Jekyll has…","html":"<p>It’s that time again, where I look at blogging something and decide I may as well change the system I’m using first.\nA developer affliction I’m sure. Jekyll has worked really well and it’s blog workflow is really good. But may as well try the new kid. Well by the time I tend to hear about these things they aren’t that new, but for some reason <a href=\"https://www.gatsbyjs.org/\">GatsbyJS</a> kept showing up in my twitter feed with people saying how awesome it is, in particular the developer experience.</p>\n<p>So that’s what the blog is on now. It wasn’t too bad at all. Sure helps they are both Markdown based. I did have to go through some of my posts and get rid of some liquid tags I used, at the start I was using <code class=\"language-text\">{% highlight %}</code> blocks for code instead of the standard Markdown code fencing blocks.  There was a few like that where Liquid tags were used and had to be replaced with more standard Markdown. That’s no bad thing I think, the blog in theory is more portable now.</p>\n<p>Experience wise, hmm it’s fast for sure, errors seem very good. The ‘Blog’ experience is a bit more involved that Jekyll at the moment. Starting a new Jeykll blog starts you in a better place for your blog that Gatsby as the moment I believe, there’s very little in the Jekyll one (that’s a good thing) which means there’s next to nothing to take out, Gatsby’s is a copy of the example blog and you need to find a remove the Author and stuff like that. Updating is also a bit of a pain at the moment, pretty much a manual compare of the latest from github.  That will improve I reckon when their ‘Themes’ become more mainstream.</p>\n<p>I don’t regret the move at all, well not yet anyway. Jekyll was no slow couch but Gatsby is spooky fast (<a href=\"https://www.gatsbyjs.org/blog/2017-09-13-why-is-gatsby-so-fast/\">they do a better job at explaining why it’s interesting</a>) and the whole thing feels more approachable as it’s npm/javascript I never had much exposer to Ruby.</p>\n<p>It has been a worthwhile learning experience, I’ve loosely done some React (very very loose) which was worth seeing, I’ve played around a bit with the basic setup, changing the ‘Bio’ a bit and using System fonts rather than web fonts. All much more straight forward than customization’s I’ve done on Jekyll and when I would a mess of them the errors pointed me in the right direction. So will stick with it for a bit maybe look at adding more to it. And maybe just maybe blog a bit more…</p>","frontmatter":{"title":"Moving Blog to Gatsby","date":"April 15, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/moving-to-gatsby/","previous":{"fields":{"slug":"/2018-03-13-transfer-itunes-and-iphone-backups-to-new-mac/"},"frontmatter":{"title":"Transfer iTunes and iPhone backups to new Mac"}},"next":null}}