{"data":{"site":{"siteMetadata":{"title":"Random Stuff About Stuff","author":"David Kerwick"}},"markdownRemark":{"id":"4ba6c3bc-a28a-5d64-8eb6-1707839aeb2e","excerpt":"Having started with IntelliJ I need a way of remembering the keyboard and other shortcuts I come across. And I think this blog will be a good place for it.  The…","html":"<p>Having started with IntelliJ I need a way of remembering the keyboard and other shortcuts I come across. And I think this blog will be a good place for it.  The IntelliJ site of course has loads, help files list them etc… but it feels like there’s millions. So want to try learn a few, let them bed in, learn some more, go back to the ones I’ve forgotten etc…</p>\n<p>Rather than just list the commands I also want to be able to re-see it in action.  The IntelliJ blog regularly has these little animated gif’s that show off a particular feature. So why not do something like that, in my own workspace on my own code.</p>\n<p>Turns out there’s a world of these things.  I had started down the line of using the screen recording capabilities of Quicktime Player to first create a movie then try get that movie converted to an animated gif.</p>\n<p>I then discovered <a href=\"http://gifbrewery.com/\">GIF Brewery</a> which at the moment is free.</p>\n<p>It can do the recording of either the whole screen or a section of it.  You can then tweak the start and end, the number of frames, resize, crop, etc… then save as a GIF.  Happy days, the only thing is the gif’s seem to be huge.  Need to take smaller sections of screen and have less frames but the app seems to have all the options needed to help get that size down.</p>\n<p>Guess I’ll see how a series of little screen grabs go.</p>","frontmatter":{"title":"Creating little animated GIF's of what's happening on screen","date":"February 02, 2017"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2017-02-02-creating-little-animated-gif-s-of-what-s-happening-on-screen/","previous":{"fields":{"slug":"/2017-02-01-adding-color-to-maven-output/"},"frontmatter":{"title":"Adding color to Maven output"}},"next":{"fields":{"slug":"/2017-02-02-intellij-switching-to-recent-files/"},"frontmatter":{"title":"IntelliJ - Switching to recent files"}}}}