{"data":{"site":{"siteMetadata":{"title":"Random Stuff About Stuff","author":"David Kerwick"}},"markdownRemark":{"id":"8aa91470-8a7c-5bf2-a2c1-933fc9875d0c","excerpt":"After custom theming the app using material 2  here  what I wanted was to be able to use the main colours again and again in my components so that everything…","html":"<p>After custom theming the app using material 2 <a href=\"../2017-01-14-material-2-customising-the-theme\">here</a> what I wanted was to be able to use the main colours again and again in my components so that everything will be the same and when they change the colours it will all ‘just work’. There isn’t as yet a baked in easy solution for this, by that I mean just using —primary or $primary.  Don’t know if there will be to be honest the Angular CLI global style is a css one, even when it’s sass it’s only available globally to the end app which has been compiled to css.</p>\n<p>The Material 2 people have mentioned they need something better themselves for reusing the main colours, I’ve asked there if whatever solution they come up with can also be used across all components including the ones normal punters write. You can check the progress and maybe chime in your thoughts <a href=\"https://github.com/angular/material2/issues/2394\">here</a> if you think it’s a good idea.</p>\n<p>For now the best option is to follow Material 2’s <a href=\"https://github.com/angular/material2/blob/master/guides/theming-your-components.md\">theming your components guide</a></p>\n<p>That means switching the Angular CLI project to use sass for the components, if you already have one setup like I have you can switch it to sass by running</p>\n<p><code class=\"language-text\">ng set defaults.styleExt scss</code></p>\n<p>You may need to rename component styles that have already been created.  If starting from new set it up with</p>\n<p><code class=\"language-text\">ng new test-cli --style=sass</code></p>\n<p>This means adding two imports to all components style files, I think it’s better to get that down to one by moving the variable definitions into the <code class=\"language-text\">your-app-theme.scss</code> that was created when you were customising the theme.</p>\n<p>I’ve added the following lines to that theme file</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">$primary : md-color($your-app-primary);\n$accent : md-color($your-app-accent);\n$warn : md-color($your-app-warn);</code></pre></div>\n<p>Then in the component <code class=\"language-text\">.scss</code> file I imported that custom theme</p>\n<p><code class=\"language-text\">@import &#39;../pcrs-app-theme.scss&#39;;</code></p>\n<p>And can use the variables <code class=\"language-text\">$primary</code>, <code class=\"language-text\">$accent</code> and <code class=\"language-text\">$warn</code></p>\n<p>Slightly better I think.  It would be good also if I could add that import line to all generated style files for components but there doesn’t seem to be a extension point for that at the moment.  The templates are there but they are deep in the bowels of the CLI project <a href=\"https://github.com/angular/angular-cli/blob/master/packages/angular-cli/blueprints/component/files/__path__/__name__.component.__styleext__\">here</a> but considering how often things are changing customising that in your local environment would be more trouble than it’s worth.</p>","frontmatter":{"title":"Material 2 - Using primary, accent and warn colours in your components","date":"January 16, 2017"}}},"pageContext":{"slug":"/2017-01-16-material-2-using-primary-accent-and-warn-colours-in-your-components/","previous":{"fields":{"slug":"/2017-01-16-material-flex-layout-switch-images-for-mobile/"},"frontmatter":{"title":"Material Flex Layout - switch images for mobile"}},"next":{"fields":{"slug":"/2017-02-01-intellij-adding-logger-definition/"},"frontmatter":{"title":"IntelliJ - Adding logger definition"}}}}