{"data":{"site":{"siteMetadata":{"title":"Random Stuff About Stuff","author":"David Kerwick"}},"markdownRemark":{"id":"8dc9f744-8dc4-5cad-8568-12372ed216df","excerpt":"Having just coming out of hunting down an oddball error I thought it might be a good idea write down some steps. Things started off with a database insert…","html":"<p>Having just coming out of hunting down an oddball error I thought it might be a good idea write down some steps.</p>\n<p>Things started off with a database insert breaching the size limits on a column. Nothing to strange at that point, but the insert was from xml data that has a schema to enforce the max size. So how could it breach the limit.</p>\n<p>Turns out the database column in question is specified using BYTE i.e. <code class=\"language-text\">VARCHAR2(20 BYTE)</code> and xml being a good internet citizen treats strings as UTF-8 so counts double byte characters as 1 like for example things with fada’s á ú etc… but they take up two bytes so if you are at the limit this can push you over the edge.</p>\n<p>Now finding the offender in a giant blob of xml is no fun. Especially when it’s an invisible character.\nSo regex to the rescue</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">[^\\x00-\\x7F]</code></pre></div>\n<p>Search for anything matching the above, so anything outside the 00 - 7f range (table <a href=\"http://www.fileformat.info/info/charset/UTF-8/list.htm\">here</a>)</p>","frontmatter":{"title":"Finding double byte characters in text files","date":"October 06, 2017"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2017-10-03-finding-double-byte-characters/","previous":{"fields":{"slug":"/2017-10-04-sonarqube-on-docker-for-mac-configuring-a-proxy/"},"frontmatter":{"title":"Sonarqube on Docker for Mac configuring a proxy "}},"next":{"fields":{"slug":"/2018-01-17-spring-boot-outputting-java-8-dates-in-rest-controllers/"},"frontmatter":{"title":"Spring Boot outputting java 8 dates in rest controllers"}}}}