{"data":{"site":{"siteMetadata":{"title":"Random Stuff About Stuff","author":"David Kerwick"}},"markdownRemark":{"id":"b0d3e1f2-d837-5ec3-848f-3a0a4a9ef6a3","excerpt":"Docker is very handy for throwing up a server and playing around with things, running things locally etc… One of the things I’ve been using it for is to run…","html":"<p>Docker is very handy for throwing up a server and playing around with things, running things locally etc…</p>\n<p>One of the things I’ve been using it for is to run Sonarqube to check some of my projects. They have a official image so it’s handy to pull down and start, I ain’t to bothered about the database being temporary or losing history when I upgrade etc…</p>\n<p>So the next thing was getting it to work in work, behind the evil proxy.</p>\n<p>I have cntlm installed on the host to deal with most of the madness of the proxy (authentication and what not)</p>\n<p>The ‘trick’ as to configure sonarqube to use it.  There’s a way of passing environment variables to the container when you first run it, but for proxies docker for mac supposedly handles that. It’s sonarqube that needs the settings.</p>\n<p>You need to edit <code class=\"language-text\">/opt/sonarqube/conf/sonar.properties</code> and set the http.proxy settings in there.</p>\n<p>i.e.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\"># HTTP proxy (default none)\nhttp.proxyHost=docker.for.mac.localhost\nhttp.proxyPort=3128</code></pre></div>\n<p>Another thing I found is to use <code class=\"language-text\">docker.for.mac.localhost</code> which is a handy way of getting the IP address of the host inside a container.</p>\n<p>Restart and you should be good to go, able to update plugins etc…</p>","frontmatter":{"title":"Sonarqube on Docker for Mac configuring a proxy ","date":"October 04, 2017"}}},"pageContext":{"slug":"/2017-10-04-sonarqube-on-docker-for-mac-configuring-a-proxy/","previous":{"fields":{"slug":"/2017-10-03-thymeleaf-replace-c-url-and-c-param/"},"frontmatter":{"title":"Thymeleaf - replace c:url and c:param"}},"next":{"fields":{"slug":"/2017-10-03-finding-double-byte-characters/"},"frontmatter":{"title":"Finding double byte  in text files"}}}}